_Rarzrabotki/Rarus/USO2/Catalogs/УСОERP_СтроительныеРаботы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>УСОERP_СтроительныеРаботы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.УСОERP_СценарииПланированияПроектовСтроительства</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодСДР</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРабот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_ВидыРабот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяСводногоСметногоРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_СтатьиСводныхСметныхРасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКонструктив</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_Конструктив</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Календари</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерРаботыВУровне</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммарнаяРабота</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UIDProject</Name>
					<Comment>Служебный реквизит, предназначен для хранения UID, загруженных из MSProject</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Веха</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КритическаяРабота</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВедущийПроцесс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоляПроекта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерРаботыВУровнеСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Задержка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаЗадержки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЕдиницыИзмеренияВремени</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Длительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаДлительности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЕдиницыИзмеренияВремени</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъемРаботы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаОбъема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьПредшественники</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОграничения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УСОERP_ТипыОграничений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОграничения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадержкаОграничения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаботаИсточник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_СтроительныеРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьРесурсы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаПредшественников</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокСортировки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Ресурсы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ресурс</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УСОERP_Ресурсы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗагрузкаПроцент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГрафикРаботы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Календари</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Трудоемкость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Машиноемкость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Норма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоНаЕдиницуОбъема</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковокНаЕдиницуОбъема</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоНаОбъемРаботы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковокНаОбъемРаботы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Предшественники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтроительнаяРабота</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УСОERP_СтроительныеРаботы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЗависимости</Name>
							<Type>
								<v8:Type>cfg:EnumRef.УСОERP_ТипыЗависимостейРабот</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Задержка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаЗадержки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЕдиницыИзмеренияВремени</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Конструктивы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Конструктив</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УСОERP_Конструктив</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Распределение</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/УСОERP_ВидыПланированияСтроительныхРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>УСОERP_ВидыПланированияСтроительныхРабот</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Календарный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месячный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НедельноСуточный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Catalogs/УСОERP_СтроительныеРаботы/Forms/ФормаСозданияРаботИзШаблона/Ext/Form/Module.bsl
&НаКлиенте
Перем КэшированныеЗначения; 

&НаСервере
Процедура СоздатьРаботыНаСервере()

	Если НЕ ЗначениеЗаполнено(Группа) Тогда
	     Сообщить("Не указана папка шаблонов");
		 Возврат;
	КонецЕсли; 
	
	ЗаполнитьСвязиВЭтойПроцедуре = Ложь;  
	
	ТаблицаСоответствия = Новый ТаблицаЗначений;
	
	ТаблицаСоответствия.Колонки.Добавить("Приемник");
	ТаблицаСоответствия.Колонки.Добавить("Источник");
	
	ВыборкаШаблоновРабот = Справочники.УСОERP_ШаблоныСтроительныхРабот.Выбрать(Группа,,,"НомерРаботыВУровне");
	
	Пока ВыборкаШаблоновРабот.Следующий() Цикл
		
		ШаблонРаботы = ВыборкаШаблоновРабот.Ссылка;
		
		Если ШаблонРаботы.Родитель <> Группа Тогда
		     Продолжить;
		КонецЕсли;
		
		Приемник = Справочники.УСОERP_СтроительныеРаботы.СоздатьЭлемент();
		
		Если ЗначениеЗаполнено(Родитель) Тогда
		    Приемник.Родитель = Родитель;			
		КонецЕсли; 
		
		Приемник.Владелец = Сценарий;
		
		Если Не ШаблонРаботы.ЭтоГруппа Тогда
			
			ДанныеКода = УСОERP_УправлениеСтроительнымПроизводством.ПолучитьКодСДРИНомерРаботыВУровне(Приемник.Владелец, Приемник.Родитель);
			Приемник.КодСДР  = ДанныеКода.КодСДР;
			Приемник.НомерРаботыВУровне 	= ДанныеКода.НомерРаботыВУровне;
			
			Приемник.СуммарнаяРабота = Ложь;
			Приемник.Наименование = ШаблонРаботы.Наименование;
			ЗаполнитьОбъектНаОсновании(Приемник, ШаблонРаботы);
			Приемник.Записать();
			ПровестиПоРегистрам(Приемник, ШаблонРаботы);
			Нстр = ТаблицаСоответствия.Добавить();
			Нстр.Приемник  = Приемник.Ссылка;
			Нстр.Источник = ШаблонРаботы;
			
		Иначе 
			Приемник.СуммарнаяРабота = Истина;
			Приемник.Наименование = ШаблонРаботы.Наименование;
			Приемник.Записать();
			Шаблон = ШаблонРаботы.ПолучитьОбъект();
			Шаблон.ЗаполнитьРаботуНаОснованииШаблона(Приемник,Шаблон,ТаблицаСоответствия);
		КонецЕсли;
		Приемник.Записать();
	КонецЦикла; 
	
	ТаблицаСоответствия.Свернуть("Приемник,Источник");
	
	Для Каждого СтрокаСоответствия ИЗ ТаблицаСоответствия Цикл
		
		Если НЕ СтрокаСоответствия.Источник.Предшественники.Количество() Тогда
			Продолжить;
		КонецЕсли;
		
		РаботаОбъект =  СтрокаСоответствия.Приемник.ПолучитьОбъект();
		
		Для Каждого СтрокаПредшественники ИЗ СтрокаСоответствия.Источник.Предшественники Цикл
			
			Строка = ТаблицаСоответствия.Найти(СтрокаПредшественники.Шаблон,"Источник");
			
			Если Строка = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Нстр = РаботаОбъект.Предшественники.Добавить();
			ЗаполнитьЗначенияСвойств(Нстр,СтрокаПредшественники);
			Нстр.СтроительнаяРабота = Строка.Приемник;		
						
		КонецЦикла;
		
		РаботаОбъект.Записать(); 		
		
	КонецЦикла; 	

КонецПроцедуры

&НаКлиенте
Процедура СоздатьРаботы(Команда)
	СоздатьРаботыНаСервере();
	ЭтаФорма.Закрыть();
КонецПроцедуры


//В процедуре заполняем Объект-Приемник на основании Объекта-Источника
//реквизиты переносим при совпадении наименований, аналогично с табличными частями
&НаСервере
Процедура ЗаполнитьОбъектНаОсновании(Приемник,Источник) Экспорт
	
	Если НЕ ТипЗнч(Источник) = Тип("Структура") Тогда
		
		ИсточникМетаданные = Источник.Метаданные();
		ПриемникМетаданные = Приемник.Метаданные();
		
		Приемник.Длительность = Источник.ДлительностьПлан;
		
		// Переносим реквизиты
		Для Каждого Реквизит из ПриемникМетаданные.Реквизиты Цикл
			
			Если Реквизит.Имя = "НомерРаботыВУровне" И ЗначениеЗаполнено(Приемник[Реквизит.Имя]) Тогда
				Продолжить;
			КонецЕсли;
			
			РеквизитИсточник = ИсточникМетаданные.Реквизиты.Найти(Реквизит.Имя);
			Если РеквизитИсточник <> Неопределено Тогда 			
				Приемник[Реквизит.Имя] = Источник[Реквизит.Имя];
			КонецЕсли;
			
		КонецЦикла;
		
		Если ТипЗнч(Приемник) = Тип("СправочникОбъект.УСОERP_СтроительныеРаботы") И Приемник.Владелец.НовыйВариант И НЕ Источник.ЭтоГруппа Тогда
			Приемник.Материалы.Загрузить(Источник.Материалы.Выгрузить());
			ТабРесурсов = Источник.Ресурсы.Выгрузить();
			ТабРесурсов.Колонки.Загрузка.Имя = "ЗагрузкаПроцент";
			Приемник.Ресурсы.Загрузить(ТабРесурсов);
		КонецЕсли;
		
	КонецЕсли;		
КонецПроцедуры


&НаСервере
Процедура ПровестиПоРегистрам(Приемник, Источник)
	
	Если Приемник.Владелец.НовыйВариант Тогда
		Возврат;
	КонецЕсли;
	
    КэшированныеЗначения = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();

	Для Каждого СтрокаМатериал Из Источник.Материалы Цикл
		МенеджерЗаписи 	= РегистрыСведений.УСОERP_ПотребностьВМатериалах.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Работа			= Приемник.Ссылка;
		МенеджерЗаписи.ВидПланирования 	= Перечисления.УСОERP_ВидыПланированияСтроительныхРабот.Календарный;	
		МенеджерЗаписи.Период			= НачалоДня(ТекущаяДата());
		МенеджерЗаписи.АвторИзмерения   = Пользователи.ТекущийПользователь();
		МенеджерЗаписи.КоличествоУпаковокНаОбъемРаботы	= Окр(СтрокаМатериал.КоличествоУпаковокНаЕдиницуОбъема * Источник.ОбъемРаботы, 3);
		МенеджерЗаписи.КоличествоНаОбъемРаботы = СтрокаМатериал.КоличествоУпаковокНаЕдиницуОбъема * ПолучитьКоэффициентУпаковки(СтрокаМатериал.Упаковка, КэшированныеЗначения)* Источник.ОбъемРаботы;

		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, СтрокаМатериал);
		МенеджерЗаписи.Записать();
	КонецЦикла;
	
		МенеджерЗаписи 	= РегистрыСведений.УСОERP_ПараметрыВыполненияРабот.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Работа				= Приемник.Ссылка;
		МенеджерЗаписи.ВидПланирования	 	= Перечисления.УСОERP_ВидыПланированияСтроительныхРабот.Календарный;
		МенеджерЗаписи.Период	        	= НачалоДня(ТекущаяДата());
		МенеджерЗаписи.АвторИзменения 		= Пользователи.ТекущийПользователь();
		МенеджерЗаписи.ОбъемРаботы			= Источник.ОбъемРаботы;
		МенеджерЗаписи.ЕдиницаОбъема		= Источник.ЕдиницаОбъема;
		МенеджерЗаписи.ДлительностьПлан		= Источник.ДлительностьПлан;
		МенеджерЗаписи.ЕдиницаДлительности	= Источник.ЕдиницаДлительности;
		
		
		МенеджерЗаписи.Записать();
	
	
	Для Каждого СтрокаРесурс Из Источник.Ресурсы Цикл
		МенеджерЗаписи 	= РегистрыСведений.УСОERP_ПотребностьВРесурсах.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Работа			= Приемник.Ссылка;
		МенеджерЗаписи.ВидПланирования 	= Перечисления.УСОERP_ВидыПланированияСтроительныхРабот.Календарный;	
		МенеджерЗаписи.ЗагрузкаПроцент  = СтрокаРесурс.Загрузка;
		МенеджерЗаписи.Период			= НачалоДня(ТекущаяДата());
		МенеджерЗаписи.АвторИзмерения   = Пользователи.ТекущийПользователь();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, СтрокаРесурс);
		МенеджерЗаписи.Записать();
	КонецЦикла;
	
КонецПроцедуры	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Родитель") Тогда
		Родитель = Параметры.Родитель;
	КонецЕсли;	
	Если Параметры.Свойство("Сценарий") Тогда
		Сценарий = Параметры.Сценарий;
	КонецЕсли;	
КонецПроцедуры

#Область ПрочиеПроцедуры

Функция ПолучитьКоэффициентУпаковки(ТекУпаковка, КэшированныеЗначения)
	
	Если ЗначениеЗаполнено(ТекУпаковка) Тогда
		
		ТекКоэффициент = КэшированныеЗначения.КоэффициентыУпаковок[ТекУпаковка];
		
		Если ТекКоэффициент = Неопределено Тогда
			
			ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТекУпаковка,"Знаменатель,Числитель,Объем,Вес");
			ТекКоэффициент = ?(ЗначенияРеквизитов.Знаменатель = 0 ИЛИ ЗначенияРеквизитов.Знаменатель = Неопределено,1,ЗначенияРеквизитов.Числитель/ЗначенияРеквизитов.Знаменатель);
			КэшированныеЗначения.КоэффициентыУпаковок.Вставить(ТекУпаковка, ТекКоэффициент);
			КэшированныеЗначения.КоэффициентыУпаковок.Вставить(ТекУпаковка, ЗначенияРеквизитов.Коэффициент);
			КэшированныеЗначения.ОбъемУпаковок.Вставить(ТекУпаковка, ЗначенияРеквизитов.Объем);
			КэшированныеЗначения.ВесУпаковок.Вставить(ТекУпаковка, ЗначенияРеквизитов.Вес);
			
		КонецЕсли;
		
	Иначе
		
		ТекКоэффициент = 1;
		
	КонецЕсли;
	
	Возврат ТекКоэффициент;
	
КонецФункции

#КонецОбласти
